/*
Напишите программу, которая принимает на вход число (N) и выдаёт таблицу квадратов 
чисел от 1 до N.
5 -> 1, 4, 9, 16, 25.
2 -> 1,4
*/

// Console.Write("Введите число N:");
// int finish = Convert.ToInt32(Console.ReadLine()); // Идем от 1 до N: [1;N]

// int start = 1; // start -> finish

// while (start <= finish)
// {
//     Console.Write(Math.Pow(start,2) + " ");
//     start++; // start++ => start = start + 1
//     // start += 1
// }

// 2 вариант:


